pmo-dataset/variations/graphviz_with_ids/17.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Process payment"];
  "Task_2" [label="Confirm delivery"];
  "Task_3" [label="Receive back-order"];
  "Task_4" [label="Prepare\ndocumentation for\ninternational orders"];
  "Task_5" [label="Initiate back-order"];
  "Task_6" [label="Customer reports\nissue"];
  "Task_7" [label="Perform quality\ncontrol checks"];
  "Task_8" [label="Dispatch order"];
  "Task_9" [label="Check stock\navailability"];
  "Task_10" [label="Prepare shipping\ndocuments and labels"];
  "Task_11" [label="Process refund"];
  "Task_12" [label="Inspect returned\nitems"];
  "Task_13" [label="Notify about failed\npayment"];
  "Task_14" [label="Update inventory\nlevels"];
  "Task_15" [label="Gift wrap items"];
  "Task_16" [label="Inform customer\nabout delay"];
  "Task_17" [label="Send return shipping\nlabel"];
  "Task_18" [label="Process replacement"];
  "Task_19" [label="Pick items from\nwarehouse"];
  "Task_20" [label="Send shipping\nconfirmation to\ncustomer"];
  "Task_21" [label="Package items"];
  "Task_22" [label="Send follow-up email"];
  "Task_23" [label="Record order details"];
  "Task_24" [label="Receive returned\nitems"];
  "Task_25" [label="Place order"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="X"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "ExclusiveGateway_5" -> "Task_11";
  "Task_11" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "ExclusiveGateway_10";
  "Task_9" -> "ExclusiveGateway_9";
  "ParallelGateway_2" -> "Task_21";
  "Task_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_11" -> "Task_9";
  "ExclusiveGateway_10" -> "ExclusiveGateway_1";
  "ExclusiveGateway_7" -> "ParallelGateway_3";
  "Task_17" -> "Task_24";
  "Task_2" -> "Task_22";
  "ExclusiveGateway_12" -> "Task_6";
  "ExclusiveGateway_12" -> "ExclusiveGateway_10";
  "ParallelGateway_1" -> "Task_14";
  "Task_6" -> "Task_17";
  "ExclusiveGateway_11" -> "Task_13";
  "ParallelGateway_4" -> "Task_2";
  "Task_12" -> "ExclusiveGateway_5";
  "Task_7" -> "ParallelGateway_2";
  "Task_14" -> "ParallelGateway_4";
  "StartNoneEvent_1" -> "Task_25";
  "Task_21" -> "ExclusiveGateway_2";
  "ExclusiveGateway_4" -> "ExclusiveGateway_8";
  "Task_20" -> "ParallelGateway_4";
  "Task_13" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "Task_19";
  "Task_19" -> "Task_7";
  "Task_8" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "EndNoneEvent_1";
  "ParallelGateway_1" -> "Task_20";
  "ParallelGateway_3" -> "Task_8";
  "ExclusiveGateway_2" -> "ExclusiveGateway_7";
  "ExclusiveGateway_2" -> "Task_15";
  "ExclusiveGateway_4" -> "Task_4";
  "Task_15" -> "ExclusiveGateway_7";
  "ExclusiveGateway_8" -> "ParallelGateway_3";
  "Task_1" -> "ExclusiveGateway_11";
  "Task_5" -> "Task_16";
  "ParallelGateway_2" -> "Task_10";
  "Task_23" -> "Task_1";
  "Task_24" -> "Task_12";
  "Task_18" -> "ExclusiveGateway_6";
  "ExclusiveGateway_9" -> "Task_5";
  "ExclusiveGateway_9" -> "ExclusiveGateway_3";
  "ParallelGateway_2" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "Task_18";
  "Task_10" -> "ParallelGateway_3";
  "Task_16" -> "Task_3";
  "Task_4" -> "ExclusiveGateway_8";
  "Task_25" -> "Task_23";
  "Task_22" -> "ExclusiveGateway_12";
}
